Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དབྱུག་པ་ཅན་གྱིས་ཕྱིར་བཟློག་ཅིང་།
en: I was turned away with a stick.

source: །དེ་དག་བདག་ལ་སྨོད་པར་བྱེད།
en: Everyone reproached me.

source: །དེ་ལྟར་ཚེ་རབས་ལྔ་བརྒྱར་ནི།
en: “Thus, for five hundred lives,

source: །གང་དང་གང་དུ་སྐྱེས་པ་དེར།
en: Wherever I was born, I died

source: །བཀྲེས་དང་སྐོམ་པའི་སྡུག་བསྔལ་གྱིས། །བདག་ནི་འཆི་བའི་དུས་བྱས་སོ།
en: After suffering from hunger and thirst.

source: །སེམས་ཅན་ཀུན་གྱིས་བདག་གི་མིང་།
en: “Every living being called me

source: །ཉེས་འོངས་པ་ཞེས་སྨད་པ་བྱས།
en: Durāgata, ‘Badly Come,’ slandering me.

source: །ཀུན་གྱི་ཡིད་དུ་མི་འོང་བས།
en: Because everyone considered me unpleasant,

source: །དེ་ཚེ་སྨད་པ་བྱེད་པར་འགྱུར།
en: I was subject to slander.

source: །བདག་གིས་རྫོགས་པའི་སངས་རྒྱས་ནི།
en: “I saw the Completely Awakened One

source: །དགེ་སློང་དགེ་འདུན་མདུན་གྱིས་བྱས།
en: Teach the supreme state

source: །སྐྱེ་བོའི་ཚོགས་ནི་ཆེན་པོ་ལ།
en: To many people

source: །དམ་པའི་གནས་ནི་སྟོན་པ་མཐོང་།
en: Before the community of monks.

source: །སྐྱེ་བོའི་ཚོགས་དེ་མཐོང་ནས་ནི།
en: “When I saw the mass of people, Expecting I would obtain

source: །ཇི་ཙམ་འདོད་པའི་ཟས་དང་སྐོམ། །རྙེད་པར་གྱུར་ན་སྟེས་སྙམ་ནས།
en: As much food and drink as I wanted,

source: །མྱུར་དུ་བརྒྱུགས་ཏེ་ཕྱིན་པ་དང་། །སྐྱེ་བོའི་ཚོགས་ནི་ཆོས་ཀྱི་ཕྱིར།
en: I quickly ran there. But when I arrived, “I saw those people Were sitting for the Dharma.

source: །འདུག་པ་དེ་ནི་མཐོང་ནས་ཀྱང་།
en: Disappointed, I turned away,

source: །ཟས་སྦྱིན་པ་ནི་མེད་དོ་ཞེས། །བདག་ནི་རེ་ཆད་སླར་ལོག་གོ།
en: Thinking that none would give me food.

source: །དེ་ནས་ཐུབ་པ་ཐུགས་རྗེ་ཅན།
en: “Then the compassionate Muni,

source: །མགོན་པོས་བདག་ལ་བཀའ་སྩལ་པ།
en: The Protector, spoke to me: ‘Svāgata (Welcome)!

source: །འོངས་པ་ལེགས་ཚུར་ཁྱོད་བདེ་འམ།
en: Are you well?

source: །སྟན་འདི་ལ་ནི་ཁྱོད་འདུག་ཤིག །བདག་ནི་དགའ་བ་ཐོབ་གྱུར་ནས།
en: You should sit down on this seat!’ “This made me joyful,

source: །ཐལ་མོ་ལེགས་སྦྱར་དེའི་འོག་ཏུ།
en: And I respectfully made the gesture of supplication.

source: །སྟོན་པའི་ཞབས་ལ་ཕྱག་བྱས་ནས།
en: Thereupon, having paid homage at the Teacher’s feet,

source: །ཕྱོགས་གཅིག་ཏུ་ནི་བདག་འདུག་གོ།
en: I sat down to one side.

source: །དེ་ནས་སྟོན་པ་ཐུགས་རྗེ་ཅན། །གཽ་ཏམ་རྗེས་སུ་ཐུགས་བརྩེ་བས།
en: “Then the compassionate Teacher,

source: །རིམ་པ་བཞིན་གྱི་གཏམ་གསུངས་པས།
en: Gautama, gave a gradual sermon Out of compassion,

source: །བདག་ནི་བདེན་པ་མཐོང་བར་བགྱིས།
en: And I saw the truths.

source: །བདེན་པ་མཐོང་ནས་ཐུབ་ཆེན་ལ། །དེ་ནས་བདག་གིས་རབ་འབྱུང་གསོལ།
en: “Having seen the truths, I asked the great Muni For permission to go forth.

source: །གཽ་ཏམ་ཐུགས་རྗེ་ཆེན་པོས་བདག །རྗེས་སུ་བརྩེ་བས་རབ་ཏུ་ཕྱུང་།
en: Gautama, who possesses great compassion, Out of mercy let me go forth.

source: །འཇིག་རྟེན་གྱི་ནི་འདྲེན་པ་ཡིས།
en: “The leader of the world

source: །བདག་མིང་ལེགས་འོངས་ཞེས་བཏགས་ཤིང་།
en: Named me Svāgata. He praises me as the best

source: །མེ་ཡི་ཁམས་ལ་སྙོམས་འཇུག་པ། །རྣམས་ཀྱི་མཆོག་ཏུ་བདག་བསྟན་ཏོ།
en: Of those who meditate on the fire element.”

source: །དེ་ལྟར་གནས་བརྟན་ལེགས་འོངས་ཀྱིས།
en: Thus the Elder Svāgata Explained his karma,

source: །ལེགས་འོངས་ཀྱི་ལེའུ་སྟེ་དགུ་པའོ།། །།
en: Here ends the ninth section: The Section of Svāgata. 10. Nandika

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་ཡོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་དགའ་ཡོད་ཚེ་དང་ལྡན་པ་ལེགས་འོངས་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Nandika, “O Venerable Nandika, the venerable Svāgata has explained his karmic bond.

source: ཚེ་དང་ལྡན་པ་དགའ་ཡོད་ཀྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་ཡོད་ཀྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Now you, Venerable Nandika, should also explain your karmic bond.” Then the venerable Nandika did explain his karmic bond: “When I was a son of the head of a guild

source: གྲོང་མཆོག་རྒྱལ་པོའི་ཁབ་ཏུ་ནི། །ཚོང་དཔོན་ཕྱུག་པོར་གྱུར་པ་ན།
en: In the most excellent city Rājagṛha,

source: །དེ་ནི་མུ་གེ་བྱུང་གྱུར་ནས།
en: A famine broke out there,

source: །དྲང་སྲོང་རྣམས་ནི་གསོ་སྐལ་དགོས།
en: And there was a need to feed ṛṣis.

source: །དེ་ན་བདག་གི་གསོ་སྐལ་དུ།
en: “There arrived

source: །སྐལ་དང་ལྡན་པའི་རང་སངས་རྒྱས།
en: A certain self-awakened one, a fortunate one,

source: །ཟག་པ་མེད་པའི་བསིལ་གྱུར་པའི།
en: An untainted, peaceful,

source: །དྲང་སྲོང་མཛེས་པ་གཅིག་ཅིག་བྱོན།
en: Beautiful ṛṣi, to be fed by me.

source: །སེམས་ནི་སེར་སྣའི་སྐྱོན་ཅན་གྱིས།
en: “Having the fault of avarice in my mind,

source: །བདག་གིས་སྡིག་པ་བསམས་པ་ནི།
en: I wrongly thought,

source: །ད་ལྟའི་དུས་སུ་དགེ་སྦྱོང་འདི།
en: ‘At the present time, who can feed

source: །ལོ་བདུན་དུ་ནི་སུ་ཞིག་གསོ།
en: This śramaṇa for seven years?’

source: །ཁྱི་ཡི་གཅིན་ནི་བསྐོལ་བ་ཡིས། །དེ་ནས་འབྲས་ཀྱི་ཆན་བཙོས་ཏེ།
en: “Then I boiled rice In horse urine

source: །དེ་ན་དྲང་སྲོང་ཟ་རུ་བཅུག །དེ་ཚེ་དེ་ནི་འཆི་དུས་བྱས།
en: And made the ṛṣi eat it; He then died.

source: །སྡིག་པའི་ལས་ནི་དེ་བྱས་པས།
en: “Since I had created that evil karma, I myself was boiled for a long time in the hells

source: །བསྡུས་གཞོམ་དང་ནི་ངུ་འབོད་དང་། །དེ་བཞིན་ཚ་བ་རབ་ཚ་བའི།
en: Such as Being Crushed, Scream, Heat, and Intense Heat.

source: །དམྱལ་བ་རྣམས་སུ་ཡུན་རིང་བཙོས།
en: “Even when, having died in hell,

source: །དམྱལ་བ་ནས་ནི་ཤི་འཕོས་བདག །མི་ཡི་སྲིད་པ་ཐོབ་ན་ཡང་།
en: I attained a human life,

source: །ནད་བུ་ཅན་ལ་གཞན་དབང་དང་། །སྡུག་བསྔལ་གྱིས་ནི་བདག་དུས་བྱས།
en: I was sick and dependent on others, And died after suffering.

source: །གང་དང་གང་དུ་སྐྱེས་པ་ན།
en: Wherever I was born, I always died

source: །མི་སྡུག་ནད་དང་མི་བཟང་པས། །རྟག་ཏུ་བདག་ནི་དུས་བྱས་སོ།
en: From unpleasant, fearful illnesses.

source: །བདག་གི་སྐྱེ་བའི་ཐ་མ་ནི།
en: “My final birth is

source: །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པ། །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ།
en: I attained nirvāṇa, The peaceful state of an arhat.

source: །བཙུན་པ་ད་ལྟར་ན་ཡང་བདག །རྫུ་འཕྲུལ་ལྡན་ཞིང་ཟག་མེད་ཀྱང་།
en: “O honored ones, even now, Possessing magical power and being untainted,

source: །ནད་བུ་ཅན་ལ་འགྲེ་ལྡོག་པ།
en: I live in sickness,

source: །དེ་ལྟ་བུས་ནི་བདག་འཚོའོ།
en: Thrashing around with such pain.”

source: །དེ་ལྟར་གནས་བརྟན་དགའ་ཡོད་ཀྱིས།
en: Thus the Elder Nandika Explained his karma,

source: །མ་འགགས་པའི་གྲོགས་པོ་དགའ་ཡོད་ཀྱི་ལེའུ་སྟེ་བཅུ་པའོ།། །།
en: Here ends the tenth section: The Section of Nandika, the Friend of Aniruddha.

source: སྡོམ་ནི།
en: Summary of Contents:

source: །འོད་སྲུང་ཤཱ་རིའི་བུ་དང་ནི།
en: Kāśyapa, Śāriputra, Maudgalyāyana, Śobhita,

source: །མཽད་གལ་བུ་དང་མཛེས་ལྡན་དང་། །སྣ་མ་གྲོ་བཞིན་ངག་དབང་དང་། །བསོད་སྙོམས་ལེགས་འོངས་དགའ་ཡོད་དོ།
en: Sumanas, Koṭīviṃśa, Vāgīśa, Piṇḍola, Svāgata, and Nandika. D.

source: །དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Verses of the Elders II 1. Yaśas (1) Thereupon the monks who were the most venerable of the elders requested the venerable Yaśas, “O Venerable Yaśas, the venerable Nandika has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་གྲགས་པ་ཚེ་དང་ལྡན་པ་དགའ་ཡོད་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Yaśas, should also explain your karmic bond.”

source: །ཚེ་དང་ལྡན་པ་གྲགས་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་གྲགས་པས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Yaśas did explain his karmic bond:

source: བདག་སྔོན་དགོན་པའི་དྲང་སྲོང་གྱུར།
en: “I was once a ṛṣi in the wilderness.

source: །གྲོང་དུ་བསོད་སྙོམས་ཕྱིར་སོང་ན། །རྣམ་པར་སྔོས་ཤིང་བམ་པ་ཡིས།
en: When I went to a village for alms,

source: །བུད་མེད་ཀྱི་ནི་རོ་ཞིག་མཐོང་།
en: I saw a woman’s dead body,

source: །བདག་གིས་ཚུལ་བཞིན་བརྟག་བྱས་ཏེ།
en: Which was blue and swollen.

source: །སྐྱིལ་མོ་ཀྲུང་བཅས་འདུག་ནས་ནི།
en: “I sat with my legs crossed And properly observed it.

source: །རྩེ་གཅིག་ཤིན་ཏུ་མཉམ་བཞག་པས།
en: I attentively practiced

source: །དེར་ནི་མི་སྡུག་བསྒོམ་པ་བྱས།
en: Meditation on impurity.

source: །བདག་འདུག་པ་ལས་དེ་ཡི་ལྟོ།
en: “While I was sitting, its belly burst

source: །རྡོལ་ནས་འཇིགས་པའི་སྒྲ་བྱུང་བ།
en: And emitted a dreadful sound.

source: །ཐོས་པར་གྱུར་ནས་བདག་ཀྱང་ནི།
en: When I heard that,

source: །ཏིང་ངེ་འཛིན་ལས་ལངས་པར་གྱུར།
en: I arose from my meditation.

source: །དེ་ཡི་ལྟོ་ན་ཡོད་པ་ཡི།
en: “I then saw the contents of its belly—

source: །ངན་སྐྱུགས་དང་ནི་ཁྲག་དང་ནི།
en: Vomit, blood,

source: །རུལ་པའི་དྲི་དང་མི་གཙང་བ།
en: A rotten smell, and excrement—

source: །ཀུན་ནས་རབ་ཏུ་འཛག་པ་མཐོང་།
en: Flow out from everywhere.

source: །རྒྱུ་མ་གཉེ་མ་མཁལ་མ་དང་། །སྙིང་དང་དེ་བཞིན་གློ་བ་ལ།
en: “The bowels, coiled intestine, kidneys, Heart, and lungs

source: །སྲིན་བུ་བརྒྱ་ཕྲག་ཟ་བྱེད་ནས།
en: Were being eaten by hundreds of worms.

source: །སླར་ཡང་སེམས་ནི་མཉམ་པར་བཞག །དེ་ཅི་འདྲ་བར་འདི་དེ་འདྲ།
en: I again concentrated my mind: “ ‘This is just like that;

source: །འདི་ཅི་འདྲ་བར་དེ་དེ་འདྲར།
en: That is just like this.’

source: །ཕྱི་ཡི་རོ་ནི་མཐོང་གྱུར་ནས།
en: Having seen another’s dead body,

source: །རང་གི་ལུས་ལ་གཏོད་པར་བྱེད།
en: I concentrated on my own body.

source: །དེ་ནས་ཏིང་འཛིན་ལས་ལངས་ནས།
en: “After that, I arose from that meditation

source: །བསྟི་གནས་སུ་ནི་སླར་ལོག་སྟེ།
en: And went back to the hermitage.

source: །དེ་ཚེ་བསོད་སྙོམས་མ་སྤྱད་དེ།
en: Then I did not walk around for alms,

source: །ཟས་ཀྱང་བཟའ་བ་མ་བྱས་སོ།
en: Or eat or drink.

source: །གང་ཚེ་བདག་ཀྱང་གྲོང་ཁྱེར་དུ།
en: “When I again entered

source: །ཟས་ཀྱི་ཆེད་དུ་ཞུགས་པ་ན།
en: The village for food,

source: །ཡིད་འཕྲོག་པ་ཡི་གཟུགས་མཐོང་ནས།
en: I saw an attractive body

source: །དེ་ལ་མི་གཙང་བསྒོམ་བྱས་པ། །དེ་ཡི་རོ་ནི་ཅི་འདྲ་བར།
en: And meditated on excrement in regard to it.

source: །གཟུགས་གཏོགས་དེ་ཀུན་དེ་འདྲ་སྟེ།
en: “ ‘Its whole appearance is The same as a dead body.

source: །ཁོང་པ་མི་གཙང་བས་གང་བ།
en: Its belly, too, is full of excrement,

source: །ཐམས་ཅད་སྨད་པ་ཡིན་ནོ་ཞེས།
en: And everything is to be despised.’

source: །དེ་ལྟར་ཡང་དང་ཡང་བསྒོམས་པས།
en: “Having thus meditated again and again,

source: །བདག་གིས་འདོད་ཆགས་བྲལ་བ་ཐོབ།
en: I achieved freedom from desire. Since I had practiced well

source: །ཚངས་པའི་གནས་པ་ཚད་མེད་པ། །བཞི་པོ་ལེགས་པར་བསྒོམས་བྱས་པས།
en: The four immeasurable pure abodes,

source: །དེ་ནས་འཆི་བའི་དུས་བྱས་ཏེ།
en: “After dying there,

source: །ཚངས་པ་ཡི་ནི་འཇིག་རྟེན་སྐྱེས།
en: I was born in the world of Brahmā.

source: །ཚངས་པའི་འཇིག་རྟེན་ཤི་འཕོས་བདག །བཱ་རཱ་ཎ་སཱིའི་གྲོང་དུ་སྐྱེས།
en: After dying in the world of Brahmā, I was born in the city of Vārāṇasī.

source: །ཚོང་དཔོན་མཆོག་གི་བུ་གཅིག་པར།
en: “Born there as the only son of the best of the heads of the guilds,

source: །དཔལ་ལྡན་བདག་ཉིད་དེར་སྐྱེས་ཏེ།
en: I was endowed with glory,

source: །ཀུན་ལ་སྡུག་ཅིང་ཡིད་འོང་བ།
en: Was lovable, pleasing to everyone,

source: །མཐར་ཕྱིན་གནས་ནི་ཐོབ་པར་གྱུར།
en: And perfect, and I attained an exalted position.

source: །བདག་ནི་ཉིན་མོ་ཡོངས་རྒྱུ་ཞིང་།
en: “I used to walk around by day

source: །མཚན་མོ་དག་ནི་ཉལ་བར་བྱེད།
en: And sleep at night.

source: །མྱུར་བར་དེ་ནས་ལངས་པ་ན།
en: When I casually woke up,

source: །དེ་ན་བུད་མེད་མང་པོ་དག །རྫ་རྔ་དང་ནི་རྔ་ཆེན་དང་། །ཁར་རྔ་པི་བང་སྔས་བཅུག་ནས།
en: I saw many women there, “Sleeping with clay drums, large drums, Gongs, and lutes as their pillows,

source: །སྒྲེན་མོར་བླ་རྡོལ་བྱེད་པ་དང་། །ལག་བརྐྱང་ནས་ནི་གཉིད་ལོག་མཐོང་།
en: Naked, talking in their sleep, With their arms stretched out.

source: །དེ་ནས་བདག་གི་སྔོན་གྱི་རྒྱུ།
en: “Then the cause from my past,

source: །མཐུ་ཆེན་པོ་ནི་སྐྱེས་པར་གྱུར།
en: Which had great power, arose. Thereupon the idea of a cemetery and excrement

source: །བདག་ལ་དེ་ནས་བུད་མེད་ལ། །དུར་ཁྲོད་མི་གཙང་འདུ་ཤེས་བྱུང་།
en: Regarding women occurred to me.

source: །དེ་ནས་སྐྱོ་བར་གྱུར་ནས་ནི།
en: “Then, disturbed,

source: །བདག་གིས་སྔངས་པའི་ཚིག་སྨྲས་པ།
en: I uttered these words out of fear:

source: །གྲོགས་པོ་བདག་ནི་གཙེས་གྱུར་ཏེ།
en: ‘O friend, I am depressed,

source: །ཀུན་ནས་འཚེ་བས་རེག་པར་གྱུར།
en: Completely caught in misery!’

source: །དེ་ནས་མལ་ནས་ལངས་ནས་ནི།
en: “Thereupon I rose from the bed

source: །ཁང་བཟངས་ནས་ནི་ཤོད་དུ་བབས།
en: And descended from the terrace.

source: །ལྷས་ནི་རྗེས་སུ་སྙིང་བརྩེ་བས།
en: Since the gods regarded me with compassion,

source: །བདག་གི་སྒོ་ནི་རྣམ་པར་ཕྱེ།
en: The door opened for me.

source: །གྲོང་ཁྱེར་ནས་ནི་མངོན་བྱུང་ནས།
en: “I left the city and

source: །འབབ་ཆུའི་ངོགས་སུ་ཉེ་བར་སོང་།
en: Went near the bank of a river.

source: །བདག་གིས་ཕ་རོལ་འགྲམ་ན་ནི།
en: On the opposite bank, I saw

source: །དགེ་སྦྱོང་དབང་པོ་བསྡམས་པ་མཐོང་།
en: A śramaṇa with trained faculties.

source: །བདག་གིས་དགེ་སྦྱོང་དེ་མཐོང་ནས། །སྒྲ་གསང་སྟོད་དེ་སྨྲས་པ་ནི།
en: “At the sight of the śramaṇa, I called out to him,

source: །དགེ་སྦྱོང་བདག་ནི་གཙེས་གྱུར་ཏེ།
en: ‘O śramaṇa, I am depressed,

source: །གྲོགས་པོ་བདག་ལ་འཚེ་བས་རེག །དེ་ནས་སྟོན་པས་བདག་ལ་ཡང་།
en: Completely caught in misery!’

source: །དེ་ཚེ་བདུད་རྩིའི་ཚིག་གསུངས་པ།
en: “Then the Teacher Gave me nectar-like words:

source: །གཞོན་ནུ་མ་འཇིགས་ཁྱོད་ཚུར་ཤོག །འདིར་ནི་ཁྱོད་ལ་འཚེ་བ་མེད།
en: ‘Son, do not be afraid. Come! No one will harm you here.’

source: །བདག་གིས་ནོར་བུའི་ལྷམ་ཕུད་དེ།
en: “I threw away my jeweled shoes,

source: །འབབ་ཆུ་ཡི་ནི་ངོགས་རྒལ་ནས། །སངས་རྒྱས་གང་ཟག་ཟླ་མེད་པ།
en: Crossed the river,

source: །ཐུགས་རྗེ་ཅན་གྱི་སྤྱན་སྔར་སོང་།
en: And went to the Buddha, that matchless man, Who has great compassion.

source: །དེ་ནས་བདག་སྐོམ་ཐུགས་ཆུད་ནས།
en: “Then, knowing my thirst,

source: །གང་ཟག་ཟླ་མེད་སྟོན་པ་དེས།
en: That matchless man, the Teacher,

source: །སྙན་པའི་ཆོས་ནི་བཀའ་སྩལ་པ།
en: Preached the sweet Dharma.

source: །དེ་ནི་སོ་སོར་བདག་གིས་རྟོགས།
en: I absorbed it.

source: །དེ་ནས་བདག་གིས་བདེན་མཐོང་ནས།
en: “Then, having seen the truths,

source: །ཐུབ་ཆེན་རབ་འབྱུང་གསོལ་བ་བཏབ།
en: I asked the great Muni for permission to go forth.

source: །གཽ་ཏམ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས།
en: Gautama, who has great compassion,

source: །ཐུགས་བརྩེ་བ་ཡིས་རབ་ཏུ་ཕྱུང་།
en: Let me go forth out of compassion.

source: །མཚན་གཅིག་ལོན་ནས་དེ་ནས་ནི།
en: “When the night was over,

source: །ཉི་མ་འཆར་ཀ་ཙམ་ན་ནི།
en: And the sun rose,

source: །བདག་གི་ཟག་པ་ཀུན་ཟད་ཅིང་།
en: My impurities vanished.

source: །བདག་ནི་བསིལ་གྱུར་མྱ་ངན་འདས།
en: I became tranquil and emancipated.”

source: །དེ་ལྟར་གནས་བརྟན་གྲགས་པ་ནི།
en: Thus the Elder Yaśas Explained his karma,

source: །གནས་བརྟན་གྲགས་པའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: Here ends the eleventh section: The Section of Yaśas. 2. Śaivala

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་དཔལ་སྐྱེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Śaivala, “O Venerable Śaivala, the venerable Yaśas has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་དཔལ་སྐྱེད་ཚེ་དང་ལྡན་པ་གྲགས་པས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: You, Venerable Śaivala, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་དཔལ་སྐྱེད་ཀྱིས་ཀྱང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་དཔལ་སྐྱེད་ཀྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Śaivala did explain his karmic bond:

source: བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ།
en: “In the city of Vārāṇasī,

source: །སྟོན་པ་འོད་སྲུང་མྱ་ངན་འདས།
en: After the nirvāṇa of the Teacher Kāśyapa,

source: །རྒྱལ་པོ་ཀྲྀ་ཀཱིས་རིན་ཆེན་ལས།
en: King Kṛkin built

source: །བྱས་པའི་མཆོད་རྟེན་ཆེན་པོ་བརྩིགས།
en: A large stūpa made of jewels. “As the eldest son

source: །རྒྱལ་པོ་ཀྲྀ་ཀཱི་གྲགས་ལྡན་བུ། །བདག་ནི་ཐུ་བོར་གྱུར་པ་ན།
en: Of the celebrated King Kṛkin,

source: །བདག་གིས་ཐོག་མར་གདུགས་ཀྱིས་ནི།
en: I set the first parasol

source: །རྒྱལ་བའི་མཆོད་རྟེན་ལ་གདགས་བྱས།
en: On the Victor’s stūpa.

source: །དགེ་བའི་ལས་ནི་དེ་བྱས་པས།
en: “Since I had created that good karma,

source: །ཕྱུག་ཅིང་ལོངས་སྤྱོད་ཆེ་བ་དང་། །ནོར་དང་འབྲུར་ནི་ལྡན་པ་ཡི།
en: Endowed with enormous property, Possessed of wealth and grain,

source: །བདག་ནི་ཡོན་བདག་ཆེན་པོར་གྱུར།
en: I was a great donor.

source: །བདག་གིས་ཚེ་རབས་ལྔ་བརྒྱར་ནི།
en: “For five hundred lives,

source: །སྦྱིན་པ་མི་ཉུང་བཏང་བྱས་ཏེ།
en: I gave generous donations

source: །སློང་བ་པ་དང་དགེ་སྦྱོང་དང་། །བྲམ་ཟེ་སོ་སོར་ཚིམ་པར་བྱས།
en: And satisfied beggars, śramaṇas, And brahmins.

source: །ཤིན་ཏུ་དང་བའི་སེམས་ཀྱིས་ནི།
en: “With a very pure mind, I satisfied five hundred self-awakened ones

source: །འདོད་ཆགས་བྲལ་ཞིང་ཟག་མེད་པ།
en: Who were free from desire, untainted,

source: །ཐ་བ་མེད་པའི་རང་སངས་རྒྱས། །ལྔ་བརྒྱ་པོ་དག་ཚིམ་པར་བྱས།
en: And free from roughness.

source: །སྲིད་པ་ཐ་མ་འདི་ལ་ནི།
en: In this final existence,

source: །ཤཱཀྱ་ཕྱུག་པོའི་རིགས་སུ་སྐྱེས།
en: I was born into a wealthy Śākyan family.

source: །བཙས་མ་ཐག་ཏུ་ཚིག་སྨྲས་པ།
en: As soon as I was born, I spoke these words:

source: །ཁྱིམ་འདི་ན་ནི་ནོར་འབྲུ་དག །ཇི་ག་ཅུང་ཟད་ཅིག་ཡོད་དམ།
en: “ ‘How much wealth and grain Is there in this house?

source: །འདི་ལྟར་སྦྱིན་པ་ངས་བཏང་སྟེ།
en: I will give this as donations

source: །དབུལ་པོ་རྣམས་ནི་ཚིམ་པར་བྱ།
en: And satisfy the poor.

source: །དབུལ་པོ་རྣམས་ལ་ཟས་བྱིན་དང་། །གཏོང་བས་ངོམས་པར་འགྱུར་བ་མེད།
en: “ ‘Giving food to the poor, I will never tire of giving.

source: །ཇི་ག་ནོར་ལྟ་ཡོད་དམ་ཁྱེད། །བདག་ལ་མྱུར་དུ་ལེགས་པར་སྨྲོས།
en: Tell me quickly How much wealth there is!’

source: །དེ་དག་བདག་གི་ཚིག་ཐོས་ནས། །ཡིད་སྐྱོ་བར་ནི་གྱུར་ནས་སུ།
en: “Having heard my words, They were frightened

source: །མ་མ་གཏོགས་པར་ཕྱོགས་དང་ནི། །ཕྱོགས་སུ་རྣམ་པར་རྒྱུག་པར་བྱེད།
en: And ran away in all directions,

source: །མ་ནི་བུ་ལ་བྱམས་པ་ཡིས།
en: Except my mother. “Out of love for her son,

source: །དེ་ཚེ་བདག་ལ་འདི་སྐད་སྨྲས།
en: My mother then said to me,

source: །ལྷ་འམ་མི་འམ་གནོད་སྦྱིན་ནམ།
en: ‘A god, a human, or a yakṣa— Who are you?

source: །ཁྱོད་སུ་བདག་ལ་མྱུར་དུ་སྨྲོས།
en: Tell me quickly!’

source: །མ་གཅིག་ཁྱོད་ཀྱི་བུ་བདག་ནི།
en: “ ‘Mother, I am your son.

source: །མི་ལགས་སྲིན་པོ་མ་ལགས་ཏེ།
en: I am human, not a rākṣasa.

source: །སྦྱིན་བདག་ཚེ་རབས་དྲན་པས་ན།
en: Remembering my previous life as a donor,

source: །རྟག་ཏུ་སྦྱིན་པ་གཏོང་བ་སྤྲོ།
en: I am always delighted to give donations.’

source: །བདག་གི་ཚིག་དེ་མས་ཐོས་ནས། །ཡིད་ནི་དགའ་བར་གྱུར་ནས་ཀྱང་།
en: “When she heard these words of mine, My mother was pleased

source: །དབུགས་འབྱིན་བྱེད་ཅིང་སྨྲས་པ་ནི།
en: And set me at ease, saying,

source: །བུ་གཅིག་ཅི་དགའ་སྦྱིན་པ་ཐོང་།
en: ‘My only son, make as many donations as you wish.’ “My mother raised me

source: །ཡོ་བྱད་མང་པོ་རྣམས་ཀྱིས་ཀྱང་། །བདག་ལ་མས་ནི་གསོ་བ་བྱས།
en: With abundant necessities.

source: །ཀུན་ལ་སྡུག་ཅིང་ཡིད་འོང་བ། །བདག་ནི་བལྟ་བས་ངོམས་མི་མྱོང་།
en: No one tired of seeing me, Who was lovable and pleasing to everyone.

source: །བདག་ནི་བཙས་མ་ཐག་ཏུ་ཡང་།
en: “As soon as I was born,

source: །ཁྱིམ་དེ་ནོར་དང་འབྲུ་རྣམས་དང་། །གསེར་དང་བྲན་དང་ལས་བྱེད་པ།
en: Our wealth, grain, Gold, slaves, and workmen

source: །རྣམས་ཀྱང་རྟག་ཏུ་འཕེལ་བར་གྱུར།
en: Began to increase constantly.

source: །དཔལ་སྐྱེད་ཁྱེའུ་ཞིག་བཙས་གྱུར་ལ།
en: “Since I had been born as an auspicious (śaivala) child,

source: །བཙས་མ་ཐག་ཏུ་སྨྲས་པས་ན།
en: And spoke as soon as I was born,

source: །བདག་གི་མིང་ནི་གཉེན་རྣམས་ཀྱིས།
en: My relatives

source: །དཔལ་སྐྱེད་ཅེས་ནི་བྱ་བར་བཏགས།
en: Named me Śaivala.

source: །དེ་ནས་བདག་གིས་སྦྱིན་བཏང་ཞིང་།
en: “Thereafter, giving donations,

source: །དབུལ་པོ་རྣམས་ནི་ཚིམ་བྱས་ཏེ།
en: I satisfied the poor.

source: །རྫོགས་པའི་སངས་རྒྱས་མཉེས་བྱས་ནས།
en: I pleased the Completely Awakened One

source: །བདག་ནི་རྙེད་མེད་འཇིགས་པའམ།
en: “I did not go forth because of worries about livelihood

source: །བུ་ལོན་ཉེན་པས་རབ་བྱུང་མིན།
en: Or suffering from debt.

source: །དེ་ཚེ་དད་པས་རབ་བྱུང་ནས།
en: At that time, having gone forth out of faith,

source: །མངོན་ཤེས་དྲུག་པོ་བདག་གིས་ཐོབ།
en: I attained the six kinds of supernormal knowledge.

source: །བདག་ནི་རྒྱལ་པོ་བློན་པོ་དང་། །དེ་བཞིན་གྲོང་མི་རྣམས་ཀྱིས་མཆོད།
en: “Venerated by the king, ministers, And citizens,

source: །ཟས་དང་བཏུང་བ་གོས་དང་ནི།
en: I obtained food, drink, robes,

source: །གནས་མལ་ཡང་ནི་རྙེད་པར་གྱུར།
en: And bedding and seats.”

source: །དེ་ལྟར་གནས་བརྟན་དཔལ་སྐྱེད་ཀྱིས།
en: Thus the Elder Śaivala Explained his karma,

source: །དཔལ་སྐྱེད་ཀྱི་ལེའུ་སྟེ་བཅུ་གཉིས་པའོ།། །།
en: Here ends the twelfth section: The Section of Śaivala. 3. Bakkula

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རབ་ཏུ་མང་པོ་རྣམས་ཀྱིས། ཚེ་དང་ལྡན་པ་བཀྐུ་ལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the many monks who were the most venerable of the elders requested the venerable Bakkula, “O Venerable Bakkula, the venerable Śaivala has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་བཀྐུ་ལ་ཚེ་དང་ལྡན་པ་དཔལ་སྐྱེད་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Bakkula, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་བཀྐུ་ལས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་བཀྐུ་ལས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Bakkula did explain his karmic bond:

source: །བདག་སྔོན་སྤོས་འཚོང་གྱུར་པ་ལས།
en: I was once a perfumer.

source: །རྣམ་པར་གཟིགས་ཀྱི་གསུང་རབ་ཀྱི།
en: In Vipaśyin’s dispensation,

source: །དགེ་སློང་དགེ་འདུན་སྤྱན་དྲངས་ནས།
en: I made an offer to the community of monks:

source: །ཁྱེད་ཅག་ཇི་སྙེད་བཞེད་པ་ཡི།
en: “ ‘I will give as much medicine

source: །སྙུན་སྨན་བདག་གིས་དབུལ་བགྱིས་ཏེ།
en: For the sick as you want. I will satisfy the community

source: །ཤུན་པ་རྩ་བ་འབྲས་བུའི་སྨན། །དགེ་འདུན་བདག་གིས་ཚིམ་པར་བགྱིས།
en: With medicines deriving from bark, roots, and fruits.’

source: །དགེ་འདུན་དབྱར་ནི་སྤྱན་དྲངས་ནས།
en: “When I had thus made an offer to the community for the rainy season,

source: །བདག་ལ་དགེ་སློང་གཅིག་ཅིག་གིས།
en: Nothing was asked for, Except once when a monk asked me

source: །ཨ་རུ་ར་གཅིག་མ་གཏོགས་པར།
en: For a fruit of the harītakī.

source: །དེ་ན་འགའ་ཡང་སློང་བ་མེད།
en: “I did not descend into any inferior state of existence

source: །བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ཏུ། །བདག་ནི་ལོག་པར་ལྷུང་མ་གྱུར།
en: For ninety-one eons.

source: །སྨན་སྦྱིན་པ་ཡི་རྣམ་སྨིན་ནི། །མཐུ་ཆེན་འདི་ནི་བལྟ་བར་གྱིས།
en: Thus, regard the great power of The maturation of the karma of giving medicine.

source: །དགེ་བ་ཆུང་ངུ་བྱས་པས་ནི།
en: “By doing a little good,

source: །ཨ་རུ་ར་ནི་གཅིག་བྱིན་པས།
en: By giving a fruit of the harītakī,

source: །ཡུན་རིང་མཐོ་རིས་རྣམས་སུ་དགའ།
en: I enjoyed the heavens for a long time.

source: །བདག་གིས་མི་ཡི་སྲིད་ཐོབ་ནས།
en: I attained a human life. When I was undergoing training,

source: །ཡུལ་འཁོར་བསོད་སྙོམས་ལེན་པ་དག །སློབ་པ་ན་ཡང་མ་མྱོང་ངོ་།
en: I did not accept the almsfood obtained from all over the land.

source: །ནུབ་གསུམ་ཁོ་ན་རིག་པ་ནི།
en: “In only three nights,

source: །གསུམ་པོ་བདག་གིས་མངོན་སུམ་བྱས།
en: I realized the threefold knowledge.

source: །ངན་ངོན་གྱིས་ནི་འཚོ་བྱས་ཤིང་།
en: I have lived in poverty

source: །ཕྱག་དར་ཁྲོད་ཀྱི་ཆོས་གོས་འཆང་།
en: And worn a robe of refuse rags. “I have not associated with

source: །ཁྱིམ་པའམ་རབ་ཏུ་བྱུང་བ་དང་། །བདག་ནི་འདྲེས་པར་མི་གནས་ཏེ།
en: Either lay people or mendicants.

source: །བདག་གི་ཚེ་ནི་ལོ་བརྒྱ་དང་། །དྲུག་བཅུ་ལྷག་ཅིག་ལོན་ན་ཡང་།
en: I am over a hundred and Sixty-one years old,

source: །ད་ཙམ་བར་དུའང་བདག་གིས་ནི།
en: “Yet, to the present,

source: །ན་བ་མངོན་པར་མི་དྲན་ཏེ།
en: I do not remember becoming sick.

source: །ཆུང་ངུ་བགྱིས་པ་འདི་དྲན་ཏེ།
en: Performing that little good.

source: །དེ་ཡི་འབྲས་བུ་ཡིད་འོང་འདོད། །བདེ་བ་འབྱུང་བ་ཉམས་སུ་མྱོང་།
en: I have experienced its pleasant, Desirable fruit, which causes happiness.”

source: །དེ་ལྟར་གནས་བརྟན་བཀྐུ་ལས།
en: Thus the Elder Bakkula Explained his karma,

source: །བཀྐུ་ལའི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: Here ends the thirteenth section: The Section of Bakkula. 4. Sthavira

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས། ཚེ་དང་ལྡན་པ་གནས་བརྟན་གནས་བརྟན་ཞེས་བྱ་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the elder called Venerable Sthavira, “O Venerable Sthavira, the venerable Bakkula has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་གནས་བརྟན་གནས་བརྟན་ཚེ་དང་ལྡན་པ་བཀྐུ་ལས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས། ཚེ་དང་ལྡན་པ་གནས་བརྟན་གནས་བརྟན་གྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །
en: Now you, Venerable Sthavira, should also explain your karmic bond.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་གནས་བརྟན་གནས་བརྟན་ཞེས་བྱ་བས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable called Sthavira did explain his karmic bond:
